
# Options
cask_args appdir: '~/Applications', require_sha: true

# Taps
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'blacktop/tap'
tap 'espanso/espanso'
tap 'jesseduffield/lazygit'
tap 'koekeishiya/formulae'
tap 'sdkman/tap'

#############################################################
# Command Line                                              #
#############################################################

# CLI Essentials
brew 'git'          # Version controll
brew 'neovim'       # Text editor
brew 'ranger'       # Directory browser
brew 'tmux'         # Term multiplexer

# CLI Basics
brew 'aria2'        # Resuming download util (better wget)
brew 'bat'          # Output highlighting (better cat)
brew 'broot'        # Interactive directory navigation
brew 'ctags'        # Indexing of file info + headers
brew 'diff-so-fancy'# Readable file compares (better diff)
brew 'duf'          # Get info on mounted disks (better df)
brew 'entr'         # Run command whenever file changes
brew 'exa'          # Listing files with info (better ls)
brew 'exiftool'     # Read, write and modify exif data
brew 'fzf'          # Fuzzy file finder and filtering
brew 'hyperfine'    # Benchmarking for arbitrary commands
brew 'jdupes'       # Duplicate file finder
brew 'jq'           # JSON parser, output and query files
brew 'most'         # Multi-window scroll pager (better less)
brew 'procs'        # Advanced process viewer (better ps)
brew 'ripgrep'      # Searching within files (better grep)
brew 'rsync'        # Fast incremental file transfer
brew 'sd'           # RegEx find and replace (better sed)
brew 'tldr'         # Community-maintained docs (better man)
brew 'tokei'        # Count lines of code (better cloc)
brew 'tree'         # Directory listings as tree structure
brew 'trash-cli'    # Record and restore removed files
brew 'watch'        # Run commands periorically
brew 'xsel'         # Copy paste access to the X clipboard
brew 'zoxide'       # Auto-learning navigation (better cd)

# CLI Monitoring and Performance Apps
brew 'bmon'         # Bandwidth utilization monitor 
brew 'ctop'         # Container metrics and monitoring
brew 'bpytop'       # Resource monitoring (like htop)
brew 'dua-cli'      # Disk usage analyzer and monitor (better du)
brew 'glances'      # Resource monitor + web and API
brew 'goaccess'     # Web log analyzer and viewer
brew 'gping'        # Interactive ping tool, with graph
brew 'speedtest-cli'# Command line speed test utility

# CLI Productivity Apps
brew 'task'         # Todo + task management

# CLI Development Suits
brew 'httpie'       # HTTP / API testing testing client
brew 'lazygit'      # Full Git management app

# CLI External Sercvices
cask 'ngrok'        # Reverse proxy for sharing localhost
brew 'tmate'        # Share a terminal session via internet
brew 'asciinema'    # Recording + sharing terminal sessions
brew 'navi'         # Browse, search, read cheat sheets

#############################################################
# Software Development                                      #
#############################################################

# Development Apps
cask 'iterm2'         # Better terminal emulator
cask 'postman'        # HTTP API testing app
cask 'visual-studio-code' # Code editor
cask 'jetbrains-toolbox'   # manage jetbrains apps

# Development Langs, Compilers, Package Managers and SDKs
brew 'gcc'            # GNU C++ compilers
brew 'go'             # Compiler for Go Lang
brew 'nvm'            # Switching node versions
brew 'pyenv'		      # switching python versions
brew 'sdkman-cli'     # SDKMAN for Java base languages
brew 'rust'           # Rust language

# DevOps
brew 'ansible'        # Automation
brew 'docker'         # Containers

# Development Utils
brew 'gh'             # Interact with GitHub PRs, issues, repos
brew 'git-extras'     # Extra git commands for common tasks
brew 'scrcpy'         # Display and control Andrdroid devices
brew 'terminal-notifier' # Trigger Mac notifications from terminal

# Network and Security Testing
brew 'bettercap'      # Network, scanning and moniroting
brew 'nmap'           # Port scanning
cask 'wireshark'      # Network analyzer + packet capture

# Security Utilities
brew 'bcrypt'         # Encryption utility, using blowfish
brew 'dnscrypt-proxy' # Proxy for using encrypted DNS
brew 'lynis'          # Scan system for common security issues
brew 'openssl'        # Cryptography and SSL/TLS Toolkit

#############################################################
# Desktop Applications                                      #
#############################################################

# Creativity
cask 'audacity'     # Audio editor / recorder
cask 'gimp'         # Photo editor
brew 'handbrake'    # Video transcoder
cask 'obs'          # Screencasting / recording
cask 'shotcut'      # Video editor

# Media
cask 'transmission' # Torrent client
cask 'vlc'          # Media player
brew 'pandoc'       # Universal file converter
brew 'youtube-dl'   # YouTube video downloader

# Personal Applications
cask '1password'      # Password manager (proprietary)
brew 'pwsafe'
cask 'webex'
cask 'hey'
cask 'notion'

# Browsers
cask 'google-chrome'
cask 'brave-browser'
cask 'firefox'

#############################################################
# MacOS-Specific Stuff                                      #
#############################################################

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-fira-code'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-meslo-lg-nerd-font'


# Mac OS Mods and Imrovments
cask 'alt-tab'        # Much better alt-tab window switcher
cask 'espanso'        # Live text expander (cross-platform)
cask 'finicky'        # Website-specific default browser
brew 'iproute2mac'    # MacOS port of netstat and ifconfig
brew 'lporg'          # Backup and restore launchpad layout
brew 'm-cli'          # All in one MacOS management CLI app
cask 'openinterminal' # Finder button, opens directory in terminal
cask 'popclip'        # Popup options for text on highlight
cask 'raycast', args: { require_sha: false }  # Spotlight alternative
cask 'shottr'         # Better screenshot utility
cask 'stats'          # System resource usage in menubar
brew 'yabai'          # Tiling window manager

# Mac OS Utility Apps
#cask 'little-snitch'  # Firewall app viewing / blocking traffic

# EOF
